'use strict'

//Напишіть код, який запитуватиме
//логін за допомогою prompt і логувати результат
//в консоль браузера
//Якщо відвідувач вводить "Адмін",
//то prompt запитує пароль.
//Якщо нічого не ввели або натиснута клавіша Esc
//Вивести стороку "Скасовано"
// Інакше вивести рядок "Я вас не знаю"
//Пароль перевіряти так:
//Якщо введено пароль "Я головний",
//то вивести рядок "Добрий день!"
//інакше виводити рядок "Невірний пароль!"
// const userRule = prompt("Введіть логін");


    //  switch userPassword {
    // case "Я головний":
    //     console.log("Добрий день!");
    //     break;
    // default:
    //     console.log("Невірний пароль!");   

const userRule = prompt("Введіть логін");


switch (userRule) {
    case "Адмін":
        console.log(prompt("Введіть пароль") === "Я головний" ? console.log("Добрий день!") : console.log("Невірний пароль!"));
        break;
    case "":
        console.log("Скасовано");
        break;
    default:
        console.log("Я вас не знаю");

}


console.log(userRule)
